app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("contact") VALUES ($1) RETURNING "id"  [["contact", "{\"name\"=>\"kjhfgf\", \"email\"=>\"sggg\", \"contact\"=>\"sgsgdsg\"}"]]
---
  def create
    @contact = contact_params
    if @contact.save

INSERT INTO "contacts" ("name", "email", "contact") VALUES ($1, $2, $3) RETURNING "id"  [["name", "affa"], ["email", "aff"], ["contact", "afaf"]]
---
  def contact_params
    Contact.create(name: params[:contact][:name], email: params[:contact][:email], content: params[:contact][:content] )